app/controllers/reservations_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", nil]]
---
   def load_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id])