app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
  	@restaurant = Restaurant.find_by(id: params[:id])

INSERT INTO "restaurants" ("name", "capacity", "address", "opening_time", "closing_time", "city", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@restaurant = Restaurant.new(restaurant_params)

  	if @restaurant.save