app/controllers/users_controller.rb

  def create
  	@user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
  	@user = User.find_by(id: params[:id])

  	if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Mr. Jack"], ["updated_at", "2015-09-10 22:29:54.891712"], ["id", 4]]

  def destroy
  	@user = User.find_by(id: params[:id])
  	@user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]